tests/fixtures/requests/serverCompletePurchase.xml

<?xml version="1.0" encoding="utf-8"?>
<order type="card" id="39188" timestamp="20161023150631"><signature>8LYN-9WEL-VL75-1UKS-STG1</signature><invoice currency="RON" amount="150.00" installments="2,3"><details><![CDATA[Donatie+pentru+Alaturi+de+Madalin+via+Alina+Cilil]]></details><contact_info><billing type="person"><first_name><![CDATA[Alina]]></first_name><last_name><![CDATA[S]]></last_name><city><![CDATA[na]]></city><address><![CDATA[Romania]]></address><email><![CDATA[alina.apetrei%40gmail.com]]></email><mobile_phone><![CDATA[0741000000]]></mobile_phone></billing><shipping type="person"><first_name><![CDATA[Alina]]></first_name><last_name><![CDATA[S]]></last_name><city><![CDATA[na]]></city><address><![CDATA[Romania]]></address><email><![CDATA[alina.apetrei%40gmail.com]]></email><mobile_phone><![CDATA[0741000000]]></mobile_phone></shipping></contact_info></invoice><url><return>http://envision.galantom.ro/donations/confirm?id=39188</return><confirm>http://envision.galantom.ro/donations/ipn?id=39188</confirm></url><mobilpay timestamp="20161023150844" crc="1e59360874ae14eb39c7a038b205bf0d"><action>confirmed</action><customer type="person"><first_name><![CDATA[Alina]]></first_name><last_name><![CDATA[S]]></last_name><city><![CDATA[na]]></city><address><![CDATA[Romania]]></address><email><![CDATA[alina.apetrei%40gmail.com]]></email><mobile_phone><![CDATA[0741000000]]></mobile_phone></customer><purchase>35410438</purchase><original_amount>150.00</original_amount><processed_amount>150.00</processed_amount><current_payment_count>1</current_payment_count><pan_masked>5****8655</pan_masked><payment_instrument_id>4463403</payment_instrument_id><installments>1</installments><error code="0"><![CDATA[Tranzactia aprobata]]></error></mobilpay></order>
